{
    "language": "english",
    "es": "spanish",
    "en": "english",
    
    "titleName": "Hi! i am Angelo Bessolo", 
    "subTitle": "Come with me and learn a little about me.",
    "aboutMe": "About me",
    "projects": "Projects",
    "experience": "Experience",

    "textAboutMe": "Hello! my name is Angelo Mateo Bessolo Rueda, I work as a software developer. I am passionate about continuous learning and technology, since I was young I have always been curious about issues facing the future and advancement of humanity such as programming, automation, space exploration, among others. I have great skills that make me stand out as teamwork, leadership, critical stance, punctuality, compliance. Always with the desire to give the maximum in any challenge I face.",
    "downloadCv": "Download CV",

    "EMPRESA:": "Company:",
    "PERIODO:": "Period:",
    "FUNCIONES": "Functions",
    "LOGROS": "Achievements",
    "Ingeniero Desarrollo y Soporte": "Engineer Development and Support",
    "Desarrollador Fullstack": "Fullstack Developer",
    "Cobol": "Cobol",
    "Db2": "Db2",
    "AS400": "AS400",
    "Html5": "Html5",
    "Css3": "Css3",
    "Js": "Js",
    "Ts": "Ts",
    "Angular": "Angular",
    "Yii2": "Yii2",
    "Mysql": "Mysql",
    "Boostrap": "Boostrap",
    "Jquery": "Jquery",
    "Taylor & Johnson Ltda": "Taylor & Johnson Ltd.",
    "SkinaTech S.A.S": "SkinaTech Ltd.",
    "03/2022 - 03/2024": "03/2022 - 03/2024",
    "03/2024 - Actual": "03/2024 - Present",
    "Durante mi trayectoria en la empresa, participé activamente en el análisis, desarrollo, soporte e implementación de nuevas funcionalidades para el sistema corporativo, optimizando su uso y asegurando su efectividad para nuestros clientes.": "During my time at the company, I actively participated in the analysis, development, support, and implementation of new functionalities for the corporate system, optimizing its use and ensuring its effectiveness for our clients.",
    "Desempeñé mis funciones siguiendo la metodología ágil Scrum, colaborando en la entrega continua de mejoras y actualizaciones del producto. Mi trabajo incluyó el uso de herramientas avanzadas como Db2 para la gestión y administración de bases de datos, así como el desarrollo en el entorno COBOL sobre AS/400, abarcando formatos como CBL, CBLLE, SQLCBLLE, CL y SDA.": "I performed my tasks following the Scrum agile methodology, collaborating in the continuous delivery of product improvements and updates. My work included using advanced tools like Db2 for database management and administration, as well as development in the COBOL environment on AS/400, covering formats like CBL, CBLLE, SQLCBLLE, CL, and SDA.",
    "Adquirí sólidos conocimientos en programación COBOL en un período de tres meses, lo que me permitió integrarme rápidamente al equipo y contribuir de manera efectiva a los proyectos asignados.": "I acquired solid COBOL programming skills in three months, which allowed me to quickly integrate into the team and contribute effectively to the assigned projects.",
    "Logré abstraer del core bancario, junto con los arquitectos, conocimientos y lógica clave del sector bancario, consolidando mi comprensión del negocio.": "I managed to abstract key banking knowledge and logic from the core system, along with architects, consolidating my understanding of the business.",
    "Análisis, desarrollo, soporte e implementación de funcionalidades para el aplicativo principal de la compañía, ORFEO NG.": "Analysis, development, support, and implementation of features for the company's main application, ORFEO NG.",
    "Mantenimiento y resolución de issues en el software.": "Maintenance and resolution of issues in the software.",
    "Gestión de control y versionamiento de código mediante GitLab.": "Management of code control and versioning through GitLab.",
    "Actualización y despliegue de cambios en producción en los servidores del cliente.": "Updating and deploying changes in production on the client's servers.",
    "Me capacité de manera continua en tecnologías como Angular, aplicando los conocimientos adquiridos de forma autónoma y aprendiendo nuevos conceptos con el apoyo de los ingenieros de la compañía.": "I continuously trained in technologies like Angular, applying the knowledge gained independently and learning new concepts with the support of the company's engineers.",
    "Desarrollé una funcionalidad para un cliente, utilizando tecnologías como Yii2 y PHP para el enrutamiento, creación de vistas e integración con bases de datos MySQL.": "I developed a feature for a client, using technologies like Yii2 and PHP for routing, creating views, and integrating with MySQL databases.",

    "socialMedia": "Social Media",

    "breadcrumb_inicio": "Home",
    "breadcrumb_experiencia": "Experience",
    "breadcrumb_proyectos": "Projects",
    "breadcrumb_acerca_de_mi": "About Me"
}